#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет график работы за указанный период в днях
Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни, ГрафикРабот) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРабот.СоздатьНаборЗаписей();
	Набор.Отбор.ГрафикРабот.Установить(ГрафикРабот);
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	ДатаКЗаписи = ДатаНачала;
	Для НомерЗаписи = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[НомерЗаписи];
		Если Запись.Дата < ДатаНачала Тогда
			
			Продолжить;
			
		ИначеЕсли Запись.Дата = ДатаКЗаписи Тогда
			
			Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
				Запись.Значение = 0;
			Иначе	          
				Запись.Значение = 1;
			КонецЕсли;
			ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
			
		Иначе
			
			Пока ДатаКЗаписи < Мин(Запись.Дата, ДатаОкончания) Цикл
				
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ГрафикРабот = ГрафикРабот;
				НоваяЗапись.Дата = ДатаКЗаписи;
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
					НоваяЗапись.Значение = 0;
				Иначе	          
					НоваяЗапись.Значение = 1;
				КонецЕсли; 
				ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
				
			КонецЦикла;
			
			Если Запись.Дата > ДатаОкончания Тогда
				
				Прервать;
				
			Иначе
				
				Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
					Запись.Значение = 0;
				Иначе	          
					Запись.Значение = 1;
				КонецЕсли;
			КонецЕсли;
			ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
		КонецЕсли; 
	КонецЦикла;
	Набор.Записать();
	
	Пока ДатаКЗаписи <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ГрафикРабот = ГрафикРабот;
		Запись.Дата = ДатаКЗаписи;
		Если Найти(ВыходныеДни, Строка(ДеньНедели(ДатаКЗаписи))) Тогда
			Запись.Значение = 0;
		Иначе	          
			Запись.Значение =1;
		КонецЕсли; 
		ДатаКЗаписи = ДатаКЗаписи + ЧислоСекундВСутках;
	КонецЦикла; 
	Набор.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли