
#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьДополнительныеЭлементыФормы(Форма)Экспорт
	
	//Добавляем кнопку
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "ВКМ_ВыполнитьКомандуЗаполнить";
	КомандаЗаполнить.Заголовок = "Заполнить"; 
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаСформироватьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить"; 
	
	// Закладка Услуги
	Форма.Элементы.Страницы.ТекущаяСтраница = Форма.Элементы.ГруппаУслуги
		
КонецПроцедуры

#КонецОбласти

