#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс	
	
	// Добавить уведомление.
	// 
	// Параметры:
	//  ТекстСообщения - Произвольный, Строка - Текст сообщения
	// 
	// Возвращаемое значение:
	//  Неопределено, СправочникОбъект.BKM_УведомленияТелеграмБоту - Добавить уведомление
	//@skip-check export-procedure-missing-comment
	Функция ДобавитьУведомление(ТекстСообщения) Экспорт
		
		НовоеУведомление = СоздатьЭлемент();
		НовоеУведомление.ТекстСообщения = ТекстСообщения; 
		
		Попытка 
			
			НовоеУведомление.Записать(); 
			Возврат НовоеУведомление;
			
		Исключение
			
			Возврат Неопределено;
			
		КонецПопытки;
		
		
	КонецФункции
	
	#КонецОбласти
	
#КонецЕсли