#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();

	
	Если Не ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ТекстСообщения = "Построение диаграммы не возможно. Ошибка получения данных для построения графика.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Возврат;
	КонецЕсли;
	
	ГрафикОтпусков = ПолучитьИзВременногоХранилища(Параметры.Адрес);  		
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуска";
	СерияОтпуска.Цвет = WebЦвета.СинеФиолетовый;
	
	СерияПродолжительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияПродолжительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияПродолжительногоОтпуска.Цвет = WebЦвета.Томатный;

	
	Для Каждого Строка Из ГрафикОтпусков Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);

		Если Строка.ПродолжительностьОтпуска > 28 Тогда 
			
			Серия = СерияПродолжительногоОтпуска;
 		
		Иначе     
			
			Серия = СерияОтпуска;
  
		КонецЕсли;  
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = НачалоДня(Строка.ДатаНачала);
		Интервал.Конец = КонецДня(Строка.ДатаОкончания);  
		
	КонецЦикла;	
	
КонецПроцедуры  

#КонецОбласти
